//შექმენით ფუნქცია სახელად manualFilter რომელსაც პირველი გადაეცემა ფუნქცია და მეორე მასივი, ამ ფუნქციაში უნდა გამოიყენოთ for ციკლი და
//გადაუარეთ გადმოცემულ მასივს, გამოიყენეთ if და გამოიძახეთ გადმოცემული ფუნქცია ამჟამინდელ ინდექსზე მდგომი მნიშნელობით, 
//თუ დაბრუნებული მნიშნელობა არის true დაამატეთ ახალ მასივში და თუ არის false არ დაამატოთ ახალ მასივში, 
//როცა მორჩება for ციკლის მუშაობა დააბრუნეთ ახალი მასივი=, გადაცემული ფუნქციიდან აუცილებლად უნდა ბრუნდებოეს boolean მნიშვნელობა, 
//და უნდა იღებდეს ერთ მნიშნელობას გადაცემულ ფუნქციაში რას შეამოწმებთ თქვენზეა დამოკიდებული


function manualFilter(innerFunc, arr) {
    let res = [];
    for (let i = 0; i < arr.length; i++) {
        if (innerFunc(arr[i])) {
            res.push(arr[i]); 
        }
    }
    return res;
}

function positive_detector(num) {
    return num > 0;
}

const numbers = [5, 2, 0, 2, -6, -2, 5, -6];
console.log(manualFilter(positive_detector, numbers)); 


 
