"""მომხმარებელს შემოატანინეთ 1 რიცხვი და შეამოწმეთ იყოფა თუ არა ეგ რიცხვი 2-ზე და 4-ზე

1) როგორ შემოვატანინო მომხმარებელს მონაცემი პროგრამაში
    ა) გამოვიყენოთ input() ფუნქცია, და შევინახოთ ის ცვლადში

2) როგორ შევამოწმოთ იყოფა თუ არა ერთი რიცხვი მეორეზე?

    მათემათიკური ახსნა: რომ გავიგოთ იყოფა თუ არა ერთი რიცხვი მეორეზე, უნდა დავაკვირდეთ ნაშთს
    თუ ნაშთი ნულია მაშინ ერთი რიცხვი ზუსტად იყოფა მეორეზე (მაგ: 5 : 5 = 1 ნაშთი(0))

    ა) სანამ მე რაიმეს გავაკეთებ კონკრეტულ მონაცემებზე იქამდე ის უნდა გარდავქმნა
    მათემათიკურ რიცხვად, იმიტომ რომ ინფუთ ფუნქცია გვიბრუნებს ჩვენ ყოველთვის სტრინგს 
    გამოვიყენოთ, int() ფუნქცია მაგ: int("5") შედეგი კი იქნება 5 ბრჭყალების გარეშე შედეგად
    
    ბ) რომ შევამოწმოთ ნაშთი არის თუ არა ნულის ტოლი გამოვიყენოთ % გაყოფა 
    (ანუ ეს გაყოფა % დაგვიბრუნებს ნაშთს მაგ: 7 % 5 = 2 - ეს არის მორჩენილი ნაწილი ანუ ნაშთი)
    შემდეგ ეგ ნაშთი შევამოწმოთ უდრის თუ არა 0, გამოვიყენოთ შედარების ოპერატორი რომელიც არის
    == ორი ტოლობა პითონში, მაგალითად  5 == 5 შედეგი იქნება True

3) როგორ დავაკავშირო ორი შედარება ერთმანეტთან, მიზეზი დაკავშირების არი ის რომ პირობაში ეწერა
და კავშრილი, ანალოგიურად მეც მჭირდება და კავშირი

    ა) გამოვიყენოთ and ოპერატორი
"""
num = int(input("enter your number: "))

print(num % 2 == 0) and (num % 4 == 0)

